In [65]:
import pandas as pd

In [66]:
# To make DataFrame using Dictionary
data = {
    'youtubers':['KSI','Mr.Beast','Sisan Baniya','MRB','Savya Kc','Surakshya Kc'],
    'gender':['Male','Male','Male','Male','Female','Female']
}

In [67]:
df = pd.DataFrame(data)
df

      youtubers  gender
0           KSI    Male
1      Mr.Beast    Male
2  Sisan Baniya    Male
3           MRB    Male
4      Savya Kc  Female
5  Surakshya Kc  Female

In [68]:
df.shape

(6, 2)

In [69]:
df.dtypes

youtubers    object
gender       object
dtype: object

* dict (default) : dict like {column -> {index -> value}}

In [70]:
# To convert DataFrame to dictionary
df.to_dict() # to_dict() or to_dict(orient = 'dict') are same

{'youtubers': {0: 'KSI',
  1: 'Mr.Beast',
  2: 'Sisan Baniya',
  3: 'MRB',
  4: 'Savya Kc',
  5: 'Surakshya Kc'},
 'gender': {0: 'Male',
  1: 'Male',
  2: 'Male',
  3: 'Male',
  4: 'Female',
  5: 'Female'}}

* ‘records’ : list like [{column -> value}, … , {column -> value}]

In [71]:
df.to_dict(orient='records')

[{'youtubers': 'KSI', 'gender': 'Male'},
 {'youtubers': 'Mr.Beast', 'gender': 'Male'},
 {'youtubers': 'Sisan Baniya', 'gender': 'Male'},
 {'youtubers': 'MRB', 'gender': 'Male'},
 {'youtubers': 'Savya Kc', 'gender': 'Female'},
 {'youtubers': 'Surakshya Kc', 'gender': 'Female'}]

* ‘list’ : dict like {column -> [values]}

In [72]:
df.to_dict(orient='list')  # mostly used

{'youtubers': ['KSI',
  'Mr.Beast',
  'Sisan Baniya',
  'MRB',
  'Savya Kc',
  'Surakshya Kc'],
 'gender': ['Male', 'Male', 'Male', 'Male', 'Female', 'Female']}

* ‘series’ : dict like {column -> Series(values)}

In [73]:
df.to_dict(orient='series')

{'youtubers': 0             KSI
 1        Mr.Beast
 2    Sisan Baniya
 3             MRB
 4        Savya Kc
 5    Surakshya Kc
 Name: youtubers, dtype: object,
 'gender': 0      Male
 1      Male
 2      Male
 3      Male
 4    Female
 5    Female
 Name: gender, dtype: object}

* ‘split’ : dict like {‘index’ -> [index], ‘columns’ -> [columns], ‘data’ -> [values]}

In [74]:
df.to_dict(orient='split') # orient='split' or orient = 'tight' are same

{'index': [0, 1, 2, 3, 4, 5],
 'columns': ['youtubers', 'gender'],
 'data': [['KSI', 'Male'],
  ['Mr.Beast', 'Male'],
  ['Sisan Baniya', 'Male'],
  ['MRB', 'Male'],
  ['Savya Kc', 'Female'],
  ['Surakshya Kc', 'Female']]}

* ‘index’ : dict like {index -> {column -> value}}

In [75]:
df.to_dict(orient='index')

{0: {'youtubers': 'KSI', 'gender': 'Male'},
 1: {'youtubers': 'Mr.Beast', 'gender': 'Male'},
 2: {'youtubers': 'Sisan Baniya', 'gender': 'Male'},
 3: {'youtubers': 'MRB', 'gender': 'Male'},
 4: {'youtubers': 'Savya Kc', 'gender': 'Female'},
 5: {'youtubers': 'Surakshya Kc', 'gender': 'Female'}}

# Cleaning the column 'gender' values to first index

In [76]:
gen = 'male'
gen[0]

'm'

In [77]:
# make the funtion to cleaning the gender
def clean_gender(gen):
    return gen[0]

In [78]:
# apply method only apply the funtion work it doesn't change the df column
df['gender'].apply(clean_gender)

0    M
1    M
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [79]:
df # apply matra garera df update hudaina tesko lagi new column banaunu parxa nai vane replace garnu parxa

      youtubers  gender
0           KSI    Male
1      Mr.Beast    Male
2  Sisan Baniya    Male
3           MRB    Male
4      Savya Kc  Female
5  Surakshya Kc  Female

In [80]:
# make the new column to update the gender
df['clean_gender'] = df['gender'].apply(clean_gender)
df

      youtubers  gender clean_gender
0           KSI    Male            M
1      Mr.Beast    Male            M
2  Sisan Baniya    Male            M
3           MRB    Male            M
4      Savya Kc  Female            F
5  Surakshya Kc  Female            F

In [81]:
# Now, I want to drop gender column
df.drop(columns=['gender']) # yasle matra original dataframe df update hudaina

      youtubers clean_gender
0           KSI            M
1      Mr.Beast            M
2  Sisan Baniya            M
3           MRB            M
4      Savya Kc            F
5  Surakshya Kc            F

In [82]:
df

      youtubers  gender clean_gender
0           KSI    Male            M
1      Mr.Beast    Male            M
2  Sisan Baniya    Male            M
3           MRB    Male            M
4      Savya Kc  Female            F
5  Surakshya Kc  Female            F

In [83]:
# Then, drop garda column auto drop hunu paryo dataframe bata, not only drop the usage step tesko lagi inplace = True garnu parxa
df.drop(columns=['gender'],inplace = True)

In [84]:
df

      youtubers clean_gender
0           KSI            M
1      Mr.Beast            M
2  Sisan Baniya            M
3           MRB            M
4      Savya Kc            F
5  Surakshya Kc            F

In [86]:
# I want to rename clean_gender to gender; and youtubers to youtube channel
df.rename({'clean_gender':'gender','youtubers':'youtube channel'}) # is didn't rename this why? because we didn't specify the axis

      youtubers clean_gender
0           KSI            M
1      Mr.Beast            M
2  Sisan Baniya            M
3           MRB            M
4      Savya Kc            F
5  Surakshya Kc            F

In [88]:
# Only define the axis it  didn't rename the original dataframe only work the one line code

  youtube channel gender
0             KSI      M
1        Mr.Beast      M
2    Sisan Baniya      M
3             MRB      M
4        Savya Kc      F
5    Surakshya Kc      F

In [89]:
df

      youtubers clean_gender
0           KSI            M
1      Mr.Beast            M
2  Sisan Baniya            M
3           MRB            M
4      Savya Kc            F
5  Surakshya Kc            F

In [90]:
# so we want to define inplace = True
df.rename({'clean_gender':'gender','youtubers':'youtube channel'},axis='columns',inplace= True)

In [91]:
df

  youtube channel gender
0             KSI      M
1        Mr.Beast      M
2    Sisan Baniya      M
3             MRB      M
4        Savya Kc      F
5    Surakshya Kc      F

# How to access column of a dataframe

In [92]:
df.columns # list of the column name in Dataframe

Index(['youtube channel', 'gender'], dtype='object')

In [93]:
df['youtube channel'] # prefere way

0             KSI
1        Mr.Beast
2    Sisan Baniya
3             MRB
4        Savya Kc
5    Surakshya Kc
Name: youtube channel, dtype: object

In [94]:
# doesn't work if the column name contains space or any other special character except underscore
df.youtube chhannel

SyntaxError: invalid syntax (2365371052.py, line 1)

* df.column_name works

* df.column name doesn't because it contains a whitespace

# Missing Values

In [96]:
data = [
    {'a':'apple','b':'banana'},{'a':'avocado','b':'berry','c':'cherry'},{'a':'appricot'}
]
df = pd.DataFrame(data)

In [98]:
# first dictionary ma c ko value missing ho that's why dataframe ma NaN aayo; Nan means missing values
df

          a       b       c
0     apple  banana     NaN
1   avocado   berry  cherry
2  appricot     NaN     NaN

In [99]:
df.dtypes

a    object
b    object
c    object
dtype: object

In [100]:
# To extract the NaN values of the c column
df['c'][0]

nan

In [101]:
# To check the types of the Non
type(df['c'][0])

float

# Checking missing values

In [102]:
df.isna() # check  the values is missing or not

       a      b      c
0  False  False   True
1  False  False  False
2  False   True   True

In [104]:
df.isnull() # isna() or isnull() are same

       a      b      c
0  False  False   True
1  False  False  False
2  False   True   True

In [107]:
# df.isna() lai vertically sum garda no of missing row in each column aauxa
df.isna().sum() # by default vertically sum hunxa

a    0
b    1
c    2
dtype: int64

In [ ]:
# plot the bar of null values
df.isna().sum().plot.bar()

# Optional

In [109]:
data = {
    'youtubers':['KSI','Mr.Beast','Sisan Baniya','MRB','Savya Kc','Surakshya Kc'],
    'gender':['Male','Male','Male','Male','Female','Female']
}
df = pd.DataFrame(data)

In [110]:
df

      youtubers  gender
0           KSI    Male
1      Mr.Beast    Male
2  Sisan Baniya    Male
3           MRB    Male
4      Savya Kc  Female
5  Surakshya Kc  Female

In [111]:
# To apply the funtion in gender column
df['gender'] = df['gender'].apply(clean_gender)

In [112]:
df

      youtubers gender
0           KSI      M
1      Mr.Beast      M
2  Sisan Baniya      M
3           MRB      M
4      Savya Kc      F
5  Surakshya Kc      F

In [113]:
df.rename({'youtubers':'youtube channel'},axis='columns',inplace=True)

In [114]:
df

  youtube channel gender
0             KSI      M
1        Mr.Beast      M
2    Sisan Baniya      M
3             MRB      M
4        Savya Kc      F
5    Surakshya Kc      F